export const internStatusOptions = [
  {
    id: 1,
    name: "ขอฝึกงาน",
  },
  {
    id: 2,
    name: "หลังจากตอบรับ",
  },
];

export const officeOptions = [
  {
    id: 1,
    name: "สำนักงานประธานวุฒิสภา",
  },
  {
    id: 2,
    name: "สำนักประชาสัมพันธ์",
  },
  {
    id: 3,
    name: "สำนักบริหารงานกลาง",
  },
  {
    id: 4,
    name: "สำนักการคลังและงบประมาณ",
  },
  {
    id: 5,
    name: "สำนักการต่างประเทศ",
  },
  {
    id: 6,
    name: "สำนักวิชาการ",
  },
  {
    id: 7,
    name: "สำนักการประชุม",
  },
  {
    id: 8,
    name: "สำนักกำกับและตรวจสอบ",
  },
  {
    id: 9,
    name: "สำนักกรรมาธิการ 1",
  },
  {
    id: 10,
    name: "สำนักกรรมาธิการ 2",
  },
  {
    id: 11,
    name: "สำนักกรรมาธิการ 3",
  },
  {
    id: 12,
    name: "สำนักกฎหมาย",
  },
  {
    id: 13,
    name: "สำนักภาษาต่างประเทศ",
  },
  {
    id: 14,
    name: "สำนักพัฒนาทรัพยากรบุคคล",
  },
  {
    id: 15,
    name: "สำนักเทคโนโลยีสารสนเทศและการสื่อสาร",
  },
  {
    id: 16,
    name: "สำนักรายงานการประชุมและชวเลข",
  },
  {
    id: 17,
    name: "สำนักการพิมพ์",
  },
  {
    id: 18,
    name: "สำนักนโยบายและแผน",
  },
  {
    id: 19,
    name: "กลุ่มตรวจสอบภายใน",
  },
  {
    id: 20,
    name: "อื่น ๆ",
  },
];

export const groupOptions = [
  {
    id: 1,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 1,
  },
  {
    id: 2,
    name: "กลุ่มงานประธานวุฒิสภา",
    officeId: 1,
  },
  {
    id: 3,
    name: "กลุ่มงานรองประธานวุฒิสภา คนที่หนึ่ง",
    officeId: 1,
  },
  {
    id: 4,
    name: "กลุ่มงานรองประธานวุฒิสภา คนที่สอง",
    officeId: 1,
  },
  {
    id: 5,
    name: "กลุ่มงานนโยบายและข้อมูล",
    officeId: 1,
  },
  {
    id: 6,
    name: "กลุ่มงานรับเรื่องราวร้องทุกข์",
    officeId: 1,
  },
  {
    id: 7,
    name: "กลุ่มงานบริหารทั่วไปและพิธีการ",
    officeId: 2,
  },
  {
    id: 8,
    name: "กลุ่มงานสารสนเทศและศูนย์บริการ (Call Center) วุฒิสภา",
    officeId: 2,
  },
  {
    id: 9,
    name: "กลุ่มงานสื่อมวลชน",
    officeId: 2,
  },
  {
    id: 10,
    name: "กลุ่มงานโสตทัศนูปกรณ์",
    officeId: 2,
  },
  {
    id: 11,
    name: "กลุ่มงานผลิตเอกสารเผยแพร่",
    officeId: 2,
  },
  {
    id: 12,
    name: "กลุ่มงานเผยแพร่ประชาธิปไตยและกิจกรรมวุฒิสภาภูมิภาค",
    officeId: 2,
  },
  {
    id: 13,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 3,
  },
  {
    id: 14,
    name: "กลุ่มงานบริหารงานบุคคล",
    officeId: 3,
  },
  {
    id: 15,
    name: "กลุ่มงานทะเบียนประวัติและสถิติ",
    officeId: 3,
  },
  {
    id: 16,
    name: "กลุ่มงานอาคารสถานที่",
    officeId: 3,
  },
  {
    id: 17,
    name: "กลุ่มงานรักษาความปลอดภัย",
    officeId: 3,
  },
  {
    id: 18,
    name: "กลุ่มงานวินัยและเสริมสร้างงานวินัย",
    officeId: 3,
  },
  {
    id: 19,
    name: "กลุ่มช่วยอำนวยการ",
    officeId: 3,
  },
];

export const requestStatusOptions = [
  {
    id: 1,
    name: "ส่งคำร้องขอฝึกงาน",
  },
  {
    id: 2,
    name: "ประสานงานกับสำนัก",
  },
  {
    id: 3,
    name: "ประสานงานกับนักศึกษา",
  },
  {
    id: 4,
    name: "ตอบรับแล้ว",
  },
  {
    id: 5,
    name: "ปฏิเสธ",
  },
  {
    id: 6,
    name: "อื่น ๆ",
  },
];

export const verifyStatusOptions = [
  {
    id: 7,
    name: "ตอบรับแล้ว",
  },
  {
    id: 8,
    name: "รอหนังสือขอความอนุเคราะห์จากสถานศึกษา",
    parentId: 14,
  },
  {
    id: 9,
    name: "ได้รับหนังสือขอความอนุเคราะห์จากสถานศึกษา",
    parentId: 14,
  },
  {
    id: 10,
    name: "เสนอผู้บริหารเพื่ออนุมัติ",
    parentId: 14,
  },
  {
    id: 11,
    name: "ผู้บริหารอนุมัติ",
    parentId: 14,
  },
  {
    id: 12,
    name: "รอส่งหนังสือตอบรับให้สถานศึกษา",
    parentId: 14,
  },
  {
    id: 13,
    name: "ส่งหนังสือตอบรับให้สถานศึกษาแล้ว",
    parentId: 14,
  },
  {
    id: 14,
    name: "รอฝึกงาน",
  },
  {
    id: 15,
    name: "อยู่ระหว่างฝึกงาน",
  },
  {
    id: 16,
    name: "สิ้นสุดระยะเวลาฝึกงาน",
  },
  {
    id: 17,
    name: "อยู่ระหว่างการจัดทำหนังสือรับรอง",
    parentId: 16,
  },
  {
    id: 18,
    name: "รอส่งหนังสือรับรอง",
    parentId: 16,
  },
  {
    id: 19,
    name: "ส่งหนังสือรับรองแล้ว",
    parentId: 16,
  },
  {
    id: 20,
    name: "สิ้นสุดการฝึกงาน",
  },
  {
    id: 21,
    name: "ยกเลิกการฝึกงาน",
  },
  {
    id: 22,
    name: "อื่น ๆ",
  },
];

export interface SelectOption {
  id: number;
  name: string;
}
