export const GROUP = [
  {
    id: 1,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 1,
  },
  {
    id: 2,
    name: "กลุ่มงานประธานวุฒิสภา",
    officeId: 1,
  },
  {
    id: 3,
    name: "กลุ่มงานรองประธานวุฒิสภา คนที่หนึ่ง",
    officeId: 1,
  },
  {
    id: 4,
    name: "กลุ่มงานรองประธานวุฒิสภา คนที่สอง",
    officeId: 1,
  },
  {
    id: 5,
    name: "กลุ่มงานนโยบายและข้อมูล",
    officeId: 1,
  },
  {
    id: 6,
    name: "กลุ่มงานรับเรื่องราวร้องทุกข์",
    officeId: 1,
  },
  {
    id: 7,
    name: "กลุ่มงานบริหารทั่วไปและพิธีการ",
    officeId: 2,
  },
  {
    id: 8,
    name: "กลุ่มงานสารสนเทศและศูนย์บริการ (Call Center) วุฒิสภา",
    officeId: 2,
  },
  {
    id: 9,
    name: "กลุ่มงานสื่อมวลชน",
    officeId: 2,
  },
  {
    id: 10,
    name: "กลุ่มงานโสตทัศนูปกรณ์",
    officeId: 2,
  },
  {
    id: 11,
    name: "กลุ่มงานผลิตเอกสารเผยแพร่",
    officeId: 2,
  },
  {
    id: 12,
    name: "กลุ่มงานเผยแพร่ประชาธิปไตยและกิจกรรมวุฒิสภาภูมิภาค",
    officeId: 2,
  },
  {
    id: 13,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 3,
  },
  {
    id: 14,
    name: "กลุ่มงานบริหารงานบุคคล",
    officeId: 3,
  },
  {
    id: 15,
    name: "กลุ่มงานทะเบียนประวัติและสถิติ",
    officeId: 3,
  },
  {
    id: 16,
    name: "กลุ่มงานอาคารสถานที่",
    officeId: 3,
  },
  {
    id: 17,
    name: "กลุ่มงานรักษาความปลอดภัย",
    officeId: 3,
  },
  {
    id: 18,
    name: "กลุ่มงานวินัยและเสริมสร้างงานวินัย",
    officeId: 3,
  },
  {
    id: 19,
    name: "กลุ่มช่วยอำนวยการ",
    officeId: 3,
  },
];
