export const GROUP = [
  {
    id: 1,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 1,
  },
  {
    id: 2,
    name: "กลุ่มงานประธานวุฒิสภา",
    officeId: 1,
  },
  {
    id: 3,
    name: "กลุ่มงานรองประธานวุฒิสภา คนที่หนึ่ง",
    officeId: 1,
  },
  {
    id: 4,
    name: "กลุ่มงานรองประธานวุฒิสภา คนที่สอง",
    officeId: 1,
  },
  {
    id: 5,
    name: "กลุ่มงานนโยบายและข้อมูล",
    officeId: 1,
  },
  {
    id: 6,
    name: "กลุ่มงานรับเรื่องราวร้องทุกข์",
    officeId: 1,
  },
  {
    id: 7,
    name: "กลุ่มงานบริหารทั่วไปและพิธีการ",
    officeId: 2,
  },
  {
    id: 8,
    name: "กลุ่มงานสารสนเทศและศูนย์บริการ (Call Center) วุฒิสภา",
    officeId: 2,
  },
  {
    id: 9,
    name: "กลุ่มงานสื่อมวลชน",
    officeId: 2,
  },
  {
    id: 10,
    name: "กลุ่มงานโสตทัศนูปกรณ์",
    officeId: 2,
  },
  {
    id: 11,
    name: "กลุ่มงานผลิตเอกสารเผยแพร่",
    officeId: 2,
  },
  {
    id: 12,
    name: "กลุ่มงานเผยแพร่ประชาธิปไตยและกิจกรรมวุฒิสภาภูมิภาค",
    officeId: 2,
  },
  {
    id: 13,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 3,
  },
  {
    id: 14,
    name: "กลุ่มงานบริหารงานบุคคล",
    officeId: 3,
  },
  {
    id: 15,
    name: "กลุ่มงานทะเบียนประวัติและสถิติ",
    officeId: 3,
  },
  {
    id: 16,
    name: "กลุ่มงานอาคารสถานที่",
    officeId: 3,
  },
  {
    id: 17,
    name: "กลุ่มงานรักษาความปลอดภัย",
    officeId: 3,
  },
  {
    id: 18,
    name: "กลุ่มงานวินัยและเสริมสร้างงานวินัย",
    officeId: 3,
  },
  {
    id: 19,
    name: "กลุ่มช่วยอำนวยการ",
    officeId: 3,
  },
  {
    id: 20,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 4,
  },
  {
    id: 21,
    name: "กลุ่มงานงบประมาณ",
    officeId: 4,
  },
  {
    id: 22,
    name: "กลุ่มงานการเงิน",
    officeId: 4,
  },
  {
    id: 23,
    name: "กลุ่มงานบัญชี",
    officeId: 4,
  },
  {
    id: 24,
    name: "กลุ่มงานพัสดุ",
    officeId: 4,
  },
  {
    id: 25,
    name: "กลุ่มงานสวัสดิการ",
    officeId: 4,
  },
  {
    id: 26,
    name: "กลุ่มงานยานพาหนะ",
    officeId: 4,
  },
  {
    id: 27,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 5,
  },
  {
    id: 28,
    name: "กลุ่มงานพิธีการทูต",
    officeId: 5,
  },
  {
    id: 29,
    name: "กลุ่มงานความสัมพันธ์ระหว่างประเทศ",
    officeId: 5,
  },
  {
    id: 30,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 6,
  },
  {
    id: 31,
    name: "กลุ่มงานวิจัยและข้อมูล",
    officeId: 6,
  },
  {
    id: 32,
    name: "กลุ่มงานห้องสมุดและพิพิธภัณฑ์",
    officeId: 6,
  },
  {
    id: 33,
    name: "กลุ่มงานติดตามและประมวลผลงานของวุฒิสภา",
    officeId: 6,
  },
  {
    id: 34,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 7,
  },
  {
    id: 35,
    name: "กลุ่มงานญัตติ",
    officeId: 7,
  },
  {
    id: 36,
    name: "กลุ่มงานกระทู้ถาม",
    officeId: 7,
  },
  {
    id: 37,
    name: "กลุ่มงานพระราชบัญญัติ",
    officeId: 7,
  },
  {
    id: 38,
    name: "กลุ่มงานระเบียบวาระการประชุมวุฒิสภา",
    officeId: 7,
  },
  {
    id: 39,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 8,
  },
  {
    id: 40,
    name: "กลุ่มงานติดตามผลการดำเนินงาน",
    officeId: 8,
  },
  {
    id: 41,
    name: "กลุ่มงานสรรหาและแต่งตั้ง",
    officeId: 8,
  },
  {
    id: 42,
    name: "กลุ่มงานถอดถอนและตรวจสอบ",
    officeId: 8,
  },
  {
    id: 43,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 9,
  },
  {
    id: 44,
    name: "กลุ่มงานคณะกรรมาธิการการเกษตรและสหกรณ์",
    officeId: 9,
  },
  {
    id: 45,
    name: "กลุ่มงานคณะกรรมาธิการการคมนาคม",
    officeId: 9,
  },
  {
    id: 46,
    name: "กลุ่มงานคณะกรรมาธิการการเงิน การคลังการธนาคาร และสถาบันการเงิน",
    officeId: 9,
  },
  {
    id: 47,
    name: "กลุ่มงานคณะกรรมาธิการการพลังงาน",
    officeId: 9,
  },
  {
    id: 48,
    name: "กลุ่มงานคณะกรรมาธิการทรัพยากรธรรมชาติและสิ่งแวดล้อม",
    officeId: 9,
  },
  {
    id: 49,
    name: "กลุ่มงานบริการเอกสารอ้างอิงในการประชุมกรรมาธิการ",
    officeId: 9,
  },
  {
    id: 50,
    name: "กลุ่มงานคณะกรรมาธิการเศรษฐกิจ การพาณิชย์และอุตสาหกรรม",
    officeId: 9,
  },
  {
    id: 51,
    name: "กลุ่มงานคณะกรรมาธิการการวิทยาศาสตร์เทคโนโลยี การสื่อสารและโทรคมนาคม",
    officeId: 9,
  },
  {
    id: 52,
    name: "กลุ่มงานคณะกรรมาธิการวิสามัญ 1",
    officeId: 9,
  },
  {
    id: 53,
    name: "กลุ่มงานคณะกรรมาธิการวิสามัญ 2",
    officeId: 9,
  },
  {
    id: 54,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 10,
  },
  {
    id: 55,
    name: "กลุ่มงานคณะกรรมาธิการศึกษา ตรวจสอบเรื่องการทุจริตและเสริมสร้างธรรมาภิบาล",
    officeId: 10,
  },
  {
    id: 56,
    name: "กลุ่มงานคณะกรรมาธิการการต่างประเทศ",
    officeId: 10,
  },
  {
    id: 57,
    name: "กลุ่มงานคณะกรรมาธิการการทหาร",
    officeId: 10,
  },
  {
    id: 58,
    name: "กลุ่มงานคณะกรรมาธิการการปกครอง",
    officeId: 10,
  },
  {
    id: 59,
    name: "กลุ่มงานคณะกรรมาธิการการพัฒนาการเมืองและการมีส่วนร่วมของประชาชน",
    officeId: 10,
  },
  {
    id: 60,
    name: "กลุ่มงานคณะกรรมาธิการการยุติธรรมและการตำรวจ",
    officeId: 10,
  },
  {
    id: 61,
    name: "กลุ่มงานคณะกรรมาธิการกิจการองค์กรตามรัฐธรรมนูญและติดตามการบริหารงบประมาณ",
    officeId: 10,
  },
  {
    id: 62,
    name: "กลุ่มงานบริการเอกสารอ้างอิงในการประชุมกรรมาธิการ",
    officeId: 10,
  },
  {
    id: 63,
    name: "กลุ่มงานคณะกรรมาธิการวิสามัญ 3",
    officeId: 10,
  },
  {
    id: 64,
    name: "กลุ่มงานคณะกรรมาธิการวิสามัญ 4",
    officeId: 10,
  },
  {
    id: 65,
    name: "กลุ่มงานคณะกรรมาธิการการท่องเที่ยว",
    officeId: 11,
  },
  {
    id: 66,
    name: "กลุ่มงานคณะกรรมาธิการการกีฬา",
    officeId: 11,
  },
  {
    id: 67,
    name: "กลุ่มงานคณะกรรมาธิการการแรงงานและสวัสดิการสังคม",
    officeId: 11,
  },
  {
    id: 68,
    name: "กลุ่มงานคณะกรรมาธิการการศึกษา",
    officeId: 11,
  },
  {
    id: 69,
    name: "กลุ่มงานคณะกรรมาธิการการสาธารณสุข",
    officeId: 11,
  },
  {
    id: 70,
    name: "กลุ่มงานคณะกรรมาธิการการพัฒนาสังคมและกิจการเด็ก เยาวชน สตรี ผู้สูงอายุ คนพิการและผู้ด้อยโอกาส",
    officeId: 11,
  },
  {
    id: 71,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 11,
  },
  {
    id: 72,
    name: "กลุ่มงานคณะกรรมาธิการวิสามัญ 5",
    officeId: 11,
  },
  {
    id: 73,
    name: "กลุ่มงานคณะกรรมาธิการวิสามัญ 6",
    officeId: 11,
  },
  {
    id: 74,
    name: "กลุ่มงานบริการเอกสารอ้างอิงในการประชุมกรรมาธิการ",
    officeId: 11,
  },
  {
    id: 75,
    name: "กลุ่มงานคณะกรรมาธิการสิทธิมนุษยชน สิทธิเสรีภาพและการคุ้มครองผู้บริโภค",
    officeId: 11,
  },
  {
    id: 76,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 12,
  },
  {
    id: 77,
    name: "กลุ่มงานกฎหมาย 1",
    officeId: 12,
  },
  {
    id: 78,
    name: "กลุ่มงานกฎหมาย 2",
    officeId: 12,
  },
  {
    id: 79,
    name: "กลุ่มงานพัฒนากฎหมาย",
    officeId: 12,
  },
  {
    id: 80,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 13,
  },
  {
    id: 81,
    name: "กลุ่มงานภาษาอังกฤษ",
    officeId: 13,
  },
  {
    id: 82,
    name: "กลุ่มงานภาษาจีนและภาษาอื่น",
    officeId: 13,
  },
  {
    id: 83,
    name: "กลุ่มงานภาษาฝรั่งเศส รัสเซีย และอิตาลี",
    officeId: 13,
  },
  {
    id: 84,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 14,
  },
  {
    id: 85,
    name: "กลุ่มงานวิชาการและการพัฒนา",
    officeId: 14,
  },
  {
    id: 86,
    name: "กลุ่มงานฝึกอบรมและสัมมนา",
    officeId: 14,
  },
  {
    id: 87,
    name: "กลุ่มงานส่งเสริมคุณธรรมและจริยธรรม",
    officeId: 14,
  },
  {
    id: 88,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 15,
  },
  {
    id: 89,
    name: "กลุ่มงานวิทยาการคอมพิวเตอร์",
    officeId: 15,
  },
  {
    id: 90,
    name: "กลุ่มงานพัฒนาระบบงานคอมพิวเตอร์",
    officeId: 15,
  },
  {
    id: 91,
    name: "กลุ่มงานบริหารระบบเครือข่ายคอมพิวเตอร์",
    officeId: 15,
  },
  {
    id: 92,
    name: "กลุ่มงานบริการระบบคอมพิวเตอร์",
    officeId: 15,
  },
  {
    id: 93,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 16,
  },
  {
    id: 94,
    name: "กลุ่มงานรายงานการประชุม",
    officeId: 16,
  },
  {
    id: 95,
    name: "กลุ่มงานชวเลข 1",
    officeId: 16,
  },
  {
    id: 96,
    name: "กลุ่มงานชวเลข 2",
    officeId: 16,
  },
  {
    id: 97,
    name: "กลุ่มงานชวเลข 3",
    officeId: 16,
  },
  {
    id: 98,
    name: "กลุ่มงานชวเลข 4",
    officeId: 16,
  },
  {
    id: 99,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 17,
  },
  {
    id: 100,
    name: "กลุ่มงานบรรณาธิการและเทคโนโลยีการพิมพ์",
    officeId: 17,
  },
  {
    id: 101,
    name: "กลุ่มงานการพิมพ์",
    officeId: 17,
  },
  {
    id: 102,
    name: "กลุ่มงานบริการพัสดุสิ่งพิมพ์และคลังสิ่งพิมพ์",
    officeId: 17,
  },
  {
    id: 103,
    name: "กลุ่มงานบริหารทั่วไป",
    officeId: 18,
  },
  {
    id: 104,
    name: "กลุ่มงานนโยบายและยุทธศาสตร์",
    officeId: 18,
  },
  {
    id: 105,
    name: "กลุ่มงานแผนงานและโครงการ",
    officeId: 18,
  },
  {
    id: 106,
    name: "กลุ่มงานติดตามและประเมินผล",
    officeId: 18,
  },
  {
    id: 107,
    name: "กลุ่มตรวจสอบภายใน",
    officeId: 19,
  },
  {
    id: 108,
    name: "อื่น ๆ",
    officeId: 20,
  },
];
