export const OFFICE = [
  {
    id: 1,
    name: "สำนักงานประธานวุฒิสภา",
  },
  {
    id: 2,
    name: "สำนักประชาสัมพันธ์",
  },
  {
    id: 3,
    name: "สำนักบริหารงานกลาง",
  },
  {
    id: 4,
    name: "สำนักการคลังและงบประมาณ",
  },
  {
    id: 5,
    name: "สำนักการต่างประเทศ",
  },
  {
    id: 6,
    name: "สำนักวิชาการ",
  },
  {
    id: 7,
    name: "สำนักการประชุม",
  },
  {
    id: 8,
    name: "สำนักกำกับและตรวจสอบ",
  },
  {
    id: 9,
    name: "สำนักกรรมาธิการ 1",
  },
  {
    id: 10,
    name: "สำนักกรรมาธิการ 2",
  },
  {
    id: 11,
    name: "สำนักกรรมาธิการ 3",
  },
  {
    id: 12,
    name: "สำนักกฎหมาย",
  },
  {
    id: 13,
    name: "สำนักภาษาต่างประเทศ",
  },
  {
    id: 14,
    name: "สำนักพัฒนาทรัพยากรบุคคล",
  },
  {
    id: 15,
    name: "สำนักเทคโนโลยีสารสนเทศและการสื่อสาร",
  },
  {
    id: 16,
    name: "สำนักรายงานการประชุมและชวเลข",
  },
  {
    id: 17,
    name: "สำนักการพิมพ์",
  },
  {
    id: 18,
    name: "สำนักนโยบายและแผน",
  },
  {
    id: 19,
    name: "กลุ่มตรวจสอบภายใน",
  },
  {
    id: 20,
    name: "อื่น ๆ",
  },
];
