export const STATUS = [
  {
    id: 1,
    name: "ส่งคำร้องขอฝึกงาน",
    type: 1,
  },
  {
    id: 2,
    name: "ประสานงานกับสำนัก",
    type: 1,
  },
  {
    id: 3,
    name: "ประสานงานกับนักศึกษา",
    type: 1,
  },
  {
    id: 4,
    name: "ตอบรับแล้ว",
    type: 3,
  },
  {
    id: 5,
    name: "ปฏิเสธ",
    type: 1,
  },
  {
    id: 6,
    name: "รอหนังสือขอความอนุเคราะห์จากสถานศึกษา",
    type: 2,
    parentId: 12,
  },
  {
    id: 7,
    name: "ได้รับหนังสือขอความอนุเคราะห์จากสถานศึกษา",
    type: 2,
    parentId: 12,
  },
  {
    id: 8,
    name: "เสนอผู้บริหารเพื่ออนุมัติ",
    type: 2,
    parentId: 12,
  },
  {
    id: 9,
    name: "ผู้บริหารอนุมัติ",
    type: 2,
    parentId: 12,
  },
  {
    id: 10,
    name: "รอส่งหนังสือตอบรับให้สถานศึกษา",
    type: 2,
    parentId: 12,
  },
  {
    id: 11,
    name: "ส่งหนังสือตอบรับให้สถานศึกษาแล้ว",
    type: 2,
    parentId: 12,
  },
  {
    id: 12,
    name: "รอฝึกงาน",
    type: 2,
  },
  {
    id: 13,
    name: "อยู่ระหว่างฝึกงาน",
    type: 2,
  },
  {
    id: 14,
    name: "สิ้นสุดระยะเวลาฝึกงาน",
    type: 2,
  },
  {
    id: 15,
    name: "อยู่ระหว่างการจัดทำหนังสือรับรอง",
    type: 2,
    parentId: 14,
  },
  {
    id: 16,
    name: "รอส่งหนังสือรับรอง",
    type: 2,
    parentId: 14,
  },
  {
    id: 17,
    name: "ส่งหนังสือรับรองแล้ว",
    type: 2,
    parentId: 14,
  },
  {
    id: 18,
    name: "สิ้นสุดการฝึกงาน",
    type: 2,
  },
  {
    id: 19,
    name: "ยกเลิกการฝึกงาน",
    type: 2,
  },
  {
    id: 20,
    name: "อื่น ๆ",
    type: 3,
  },
];
